docs/out/help/supply/technical-description.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>THERMOS Supply Model Description</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="CSE" />
</head>
<body>
<div id="content">
<h1 class="title">THERMOS Supply Model Description</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#day-types-and-intervals">1. Day types and intervals</a>
<ul>
<li><a href="#orgdbe4c19">1.1. Day types</a></li>
<li><a href="#org094a97d">1.2. Intervals</a></li>
</ul>
</li>
<li><a href="#org0558db1">2. Decision variables</a></li>
<li><a href="#orgdef30a4">3. Supply cost</a>
<ul>
<li><a href="#orgdb36de8">3.1. Capital and operating costs</a></li>
<li><a href="#org83c841d">3.2. Fuel and emissions costs</a></li>
<li><a href="#org3881559">3.3. Grid export</a></li>
<li><a href="#org87a831d">3.4. Substation headroom</a></li>
<li><a href="#org77afd8c">3.5. Curtailment</a></li>
</ul>
</li>
<li><a href="#org35c9cc4">4. Formal description</a>
<ul>
<li><a href="#org9af2d96">4.1. Objective</a></li>
<li><a href="#org21ac29f">4.2. Constraints</a></li>
</ul>
</li>
<li><a href="#org8065741">5. Future work</a></li>
</ul>
</div>
</div>
<p>
THERMOS includes a supply optimisation model.
This part of THERMOS tries to determine a set of choices about how to build an energy center which can meet a certain heat demand at least cost.
</p>

<p>
It is coupled to the network optimisation model through the network model's choice of which buildings to connect, via a method described in the section describing <a href="network-model-interface.html">the relationship between network and supply models</a>.
</p>

<div id="outline-container-day-types-and-intervals" class="outline-2">
<h2 id="day-types-and-intervals"><span class="section-number-2">1</span> Day types and intervals</h2>
<div class="outline-text-2" id="text-day-types-and-intervals">
<p>
The key difference between the supply model and the network model is a trade-off between the representation of time and the representation of space.
</p>

<p>
In the network model, the representation of space is quite detailed, as the model knows about the topology of the network. However, the representation of time is very simple, containing only peak and average operating conditions.
</p>

<p>
In the supply model this is the other way around. The representation of space is removed, and every decision about the network is fixed. Only the demand at the supply remains. However the representation of time is much more detailed, as the supply model decides about the operation of the system at many more than just two times.
</p>

<p>
The supply model's view of time is broken up into a large number of representative periods. At the first level of this are <b>day types</b>.
</p>
</div>

<div id="outline-container-orgdbe4c19" class="outline-3">
<h3 id="orgdbe4c19"><span class="section-number-3">1.1</span> Day types</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A day type is a kind of archetypal day. In principle the supply model could have 365 different days in a year, or 3650 for ten years, and so on.
</p>

<p>
Instead it is more reasonable and easier for the model if we go in the other direction and characterise the year in terms of a few types of day. For example in the default inputs the supply model considers the following day types (days / year in parentheses):
</p>

<ul class="org-ul">
<li>Normal Weekday (197/365)</li>
<li>Normal Weekend (78/365)</li>
<li>Winter Weekday (62/365)</li>
<li>Winter Weekend (27/365)</li>
<li>Peak Day (1/365)</li>
</ul>

<p>
Each day type is then divided into a number of equal <b>intervals</b>
</p>
</div>
</div>

<div id="outline-container-org094a97d" class="outline-3">
<h3 id="org094a97d"><span class="section-number-3">1.2</span> Intervals</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Within a given day type there are a certain number of intervals, which all have equal length. The standard inputs have 24 intervals in each day type, so each interval represents 1 hour from the day of that type.
</p>

<p>
This means that the optimiser can make different decisions about what happens down to that hour, but not to the half-hour or below.
</p>
</div>
</div>
</div>

<div id="outline-container-org0558db1" class="outline-2">
<h2 id="org0558db1"><span class="section-number-2">2</span> Decision variables</h2>
<div class="outline-text-2" id="text-2">
<p>
The supply optimiser's job is to make a choice about how to meet a given demand for heat, at minimum cost.
</p>

<p>
The primary decisions available to the supply optimiser are:
</p>

<ul class="org-ul">
<li><p>
What <b>plant</b> to purchase?
</p>

<p>
This is effectively equipment that produces heat at a certain unit cost.
In the user interface a 'menu' of supply options can be defined; for each of these, the optimiser can choose what capacity to purchase.
</p></li>

<li><p>
What <b>heat storage</b> to purchase?
</p>

<p>
This is equipment which can be charged up with heat at one time during a day, and discharged later, with some loss.
Again, as a user you can define a menu of storage options, from which the optimiser can choose what to purchase.
</p></li>
</ul>

<p>
Along with these decisions the supply optimiser must make operational decisions
</p>

<ul class="org-ul">
<li>In each interval of time, how much heat to <b>generate</b> from each item of plant, and</li>
<li>How much heat to <b>store</b> into each item of storage</li>
</ul>
</div>
</div>

<div id="outline-container-orgdef30a4" class="outline-2">
<h2 id="orgdef30a4"><span class="section-number-2">3</span> Supply cost</h2>
<div class="outline-text-2" id="text-3">
<p>
Now we have a demand profile we can think about the cost of producing heat to meet that profile. The costs considered are:
</p>

<ol class="org-ol">
<li>Capital and operating costs for plant &amp; storage</li>
<li>Fuel and emissions costs for plant</li>
<li>Grid export for CHP plant</li>
<li>Curtailment costs for any unmet demand</li>
</ol>
</div>

<div id="outline-container-orgdb36de8" class="outline-3">
<h3 id="orgdb36de8"><span class="section-number-3">3.1</span> Capital and operating costs</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Plant and storage definitions each have capital cost terms, broken down as a fixed cost, cost per kW capacity, and cost per kWh.
</p>

<p>
The capital cost for plant is
</p>

<p>
\[
\text{fixed cost} + [ \text{cost per kW} \times \max_{t \in T} \text{output}_t ] + [ \text{cost per kWh} \times \sum_{t \in T} \text{output}_t \times \text{weight}_t ]
\]
</p>

<p>
Where \(\text{weight}_t\) is the number of kWh per year that interval \(t\) would contribute at an output of 1 kW; for example, an interval representing half an hour, in a day that occurs 50 days per year, would have a weight of 25. \(T\) is the set of all the intervals modelled in the profile.
</p>

<p>
The capital cost for storage is similar, except that the cost per kWh is in terms of kWh <i>storage capacity</i> rather than kWh <i>output</i>:
</p>

<p>
\[
\text{fixed cost} + [ \text{cost per kW} \times \max_{t \in T} \text{flow}_t ] + [ \text{cost per kWh} \times \max_{t \in T} \text{charge}_t ]
\]
</p>

<p>
Where \(\text{flow}_t\) is the charging rate during interval \(t\) (so the maximum of this is the capacity of the connection between the store and the plant), and \(\text{charge}_t\) is the number of kWh of heat that are in the store at time \(t\) (so the maximum of this is the capacity of store required).
</p>

<p>
Both plant and storage have a given lifetime - if the plant or store must be replaced during the accounting period of the optimisation, the capital costs are paid again each time the lifetime is reached.
</p>

<p>
Operating costs are only calculated for the plant, and follow the same formula as the plant capital cost formula; the resulting cost is incurred every year the plant operates.
</p>
</div>
</div>

<div id="outline-container-org83c841d" class="outline-3">
<h3 id="org83c841d"><span class="section-number-3">3.2</span> Fuel and emissions costs</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Fuel costs are incurred by plant when it operates; for each plant, in every time interval \(t\) there is a fuel price per kWh entered by the user. Each plant also has a heat production efficiency. The annual fuel cost for the plant is then given by
</p>

<p>
\[
\sum_{t\in T} \frac{\text{output}_t}{\text{efficiency}} \times \text{price}_t \times \text{weight}_t
\]
</p>

<p>
Emissions costs are similar, except with an additional time-varying emissions factor for the fuel:
</p>

<p>
\[
\sum_{t\in T, e \in E} \frac{\text{output}_t}{\text{efficiency}} \times \text{factor}_{t,e} \times \text{weight}_t \times \text{unit cost}_e
\]
</p>

<p>
where \(e\) is an emissions type (CO<sub>2</sub>, NO<sub>X</sub>, &#x2026;) from the set of modelled emissions types \(E\)
</p>
</div>
</div>

<div id="outline-container-org3881559" class="outline-3">
<h3 id="org3881559"><span class="section-number-3">3.3</span> Grid export</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Some plant is marked as CHP, and has a power efficiency as well as a heat efficiency. 
For these types of plant, an additional revenue (or potentially cost) is incurred when the plant runs, as it produces power to sell to the grid.
</p>

<p>
The value for this is analogous to the fuel cost, but with a different price and efficiency.
</p>
</div>
</div>

<div id="outline-container-org87a831d" class="outline-3">
<h3 id="org87a831d"><span class="section-number-3">3.4</span> Substation headroom</h3>
<div class="outline-text-3" id="text-3-4">
<p>
An important consideration for both CHP and electrically powered plant is substation headroom. In THERMOS, substation capacity is modelled as a hard constraint on how much power the substation can deliver or accept in any time interval.
</p>

<p>
Each substation also has a user-input timeseries of pre-existing demand, which determines the headroom (spare capacity); in every modelled interval the sum of pre-existing demand and new demand net of any CHP generation must not exceed the substation's capacity.
</p>
</div>
</div>

<div id="outline-container-org77afd8c" class="outline-3">
<h3 id="org77afd8c"><span class="section-number-3">3.5</span> Curtailment</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Curtailment gives the optimiser the possibility to undersupply heat in a given interval. It is included mostly so that the problem cannot become infeasible. Each kWh of heat un-supplied due to curtailment incurs a very high cost, so the optimiser should only choose to undersupply if the maximum possible plant capacity is insufficient, or if the cost of producing heat is exceedingly large.
</p>
</div>
</div>
</div>

<div id="outline-container-org35c9cc4" class="outline-2">
<h2 id="org35c9cc4"><span class="section-number-2">4</span> Formal description</h2>
<div class="outline-text-2" id="text-4">
<p>
The problem is defined over the following sets and parameters. All costs are adjusted for replacement lifetime, accounting period and discount rate before doing any optimisation, so operating and capital costs are combined, and fuel prices and emissions costs are combined.
</p>

<dl class="org-dl">
<dt>Time intervals</dt><dd>\(T\), usually indexed by \(t\)
<dl class="org-dl">
<dt>Weight</dt><dd>\(w_t\), a parameter indicating how many hours per year interval \(t\) stands for</dd>
<dt>Heat demand</dt><dd>\(h_t\), the heat demand in kW in interval \(t\)</dd>
<dt>Fuel cost</dt><dd>\(Price_{t,p}\) the cost per kWh of fuel for plant \(p\) in time \(t\)</dd>
<dt>Substation load</dt><dd>\(Load_{t,s}\), the existing demand on substation \(s\) in time \(t\) in kW</dd>
<dt>Grid offer</dt><dd>\(Grid_{t}\), the price offered by the grid per kWh of electricity in time \(t\)</dd>
</dl></dd>
<dt>Plant</dt><dd>\(P\), usually indexed by \(p\)
<dl class="org-dl">
<dt>Capacity</dt><dd>\(MaxCap_p\), the maximum output in kW from a plant of type \(p\)</dd>
<dt>Heat Efficiency</dt><dd>\(eH_{p}\), the rate of heat production per fuel for plant \(p\)</dd>
<dt>Power Efficiency</dt><dd>\(eP_{p}\), the rate of electricity production per fuel for plant \(p\), if it is a CHP</dd>
<dt>Substation</dt><dd>\(Sub_{p}\), one of the substations in \(N\), if the plant is connected to a substation we are interested in</dd>
<dt>Cost</dt><dd>\(CFix_p\), \(CCap_p\), \(COut_p\) as fixed, per-kw, and per-kwh capital and operating costs for \(p\).</dd>
</dl></dd>
<dt>Storage</dt><dd>\(S\), usually indexed by \(s\)
<dl class="org-dl">
<dt>Capacity</dt><dd>\(MaxCapF_s\), the maximum connection size in kW, and \(MaxCapS_s\) the maximum storage size in kWh</dd>
<dt>Cycle efficiency</dt><dd>\(e_{s}\), the proportion of heat output per unit of heat stored.</dd>
<dt>Cost</dt><dd>\(CFix_s\), \(CCapF_s\), \(CCapS_s\) as fixed, per-kw, and per-kwh capital costs for \(s\).</dd>
</dl></dd>
<dt>Substation</dt><dd>\(N\), indexed by \(n\)
<dl class="org-dl">
<dt>Capacity</dt><dd>\(Cap_n\), the substation forward capacity in kW, and \(R_n\), the ratio of reverse capacity to forward</dd>
<dt>Load</dt><dd>\(L_{n, t}\), the prior load on the substation in kW in time \(t\)</dd>
</dl></dd>
</dl>
</div>

<div id="outline-container-org9af2d96" class="outline-3">
<h3 id="org9af2d96"><span class="section-number-3">4.1</span> Objective</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The decisions to be made are then
</p>

<ul class="org-ul">
<li>\(Purchase_p\), whether to buy plant \(p\) (binary)
<ul class="org-ul">
<li>\(Cap_p\), the capacity of that plant to buy</li>
</ul></li>
<li>\(Purchase_s\), whether to buy storage \(s\) (binary)
<ul class="org-ul">
<li>\(CapF_s\), the flow capacity to buy for \(s\)</li>
<li>\(CapS_s\), the storage capacity to buy for \(s\)</li>
</ul></li>
<li>\(Output_{p, t}\), the heat output from plant \(p\) in interval \(t\)</li>
<li>\(FlowIn_{s, t}\) and \(FlowOut_{s, t}\) the heat flow in and out of store \(s\) in time \(t\)</li>
<li>\(Curtailment_{t}\), the curtailment in time \(t\).</li>
</ul>

<p>
The objective is to minimize
</p>

<p>
\[ TotalCost = PlantCost + StoreCost + FuelCost + CurtailmentCost - GridRevenue \]
</p>

<p>
Where
</p>

<p>
\[
PlantCost =  \sum_p Purchase_p \times CFix_p + Cap_p \times CCap_p + (\sum_t w_t \times COut_p \times Output_{p, t}) 
\]
</p>

<p>
and
</p>

<p>
\[
StoreCost =  \sum_s Purchase_s \times CFix_s + CapF_s \times CCapF_s + CapS_s \times CCapS_s
\]
</p>

<p>
and
</p>

<p>
\[
FuelCost = \sum_{t, p} w_t \times Price_{t, p} \times Output_{p, t} / eH_{p}
\]
</p>

<p>
and 
</p>

<p>
\[
CurtailmentCost = \sum_t w_t \times Curtailment_t \times C
\]
</p>

<p>
where \(C\) is a big number
</p>

<p>
and 
</p>

<p>
\[
GridRevenue = \sum_{t, p} w_t \times Grid_{t} \times eP_{p} \times Output_{p, t} / eH_{p}
\]
</p>

<p>
summing over CHP plants only
</p>
</div>
</div>

<div id="outline-container-org21ac29f" class="outline-3">
<h3 id="org21ac29f"><span class="section-number-3">4.2</span> Constraints</h3>
<div class="outline-text-3" id="text-4-2">
<p>
To make the optimiser pay for what it uses, the objective is solved subject to:
</p>

<dl class="org-dl">
<dt>Satisfied demand</dt><dd><p>
\(\forall t : \sum_p Output_{p, t} + \sum_s (e_s \times FlowOut_{s, t} - FlowIn_{s, t}) + Curtailment_t \geq h_t\)
</p>

<p>
Ensures that in each time slice, at least as much heat is produced as is needed.
Storage cycle efficiency is applied here, through the multiplication with \(e_s\).
</p>

<p>
This can be made an equality, if overproduction of heat to sell power is not allowed.
</p></dd>
<dt>Indicators</dt><dd><p>
\(\forall p : Cap_p \leq Purchase_p \times MaxCap_p\) and \(\forall s : CapF_s \leq Purchase_s \times MaxCapF_s\)
</p>

<p>
These constraints ensure that the fixed costs are paid if any storage or plant capacity is used.
</p></dd>
<dt>Plant capacity sufficient</dt><dd>\(\forall p, t: Output_{p, t} \leq Cap_p\)</dd>
<dt>Store flow sufficient</dt><dd>\(\forall s, t: FlowIn_{s, t} \leq CapF_s\), and \(\forall s, t: FlowOut_{s, t} \times e_s \leq CapF_s\)</dd>
<dt>Store size sufficient</dt><dd>\(\forall s, t: Charge_{s, t} \leq CapC_s\)</dd>
<dt>Store charge balance</dt><dd><p>
\(\forall s, t: Charge_{s, t} = Charge_{s, t-1} + H_t \times (FlowIn_{s, t-1} - FlowOut{s, t-1})\)
</p>

<p>
Where \(H_t\) is the number of hours time-slice \(t\) represents in the day, and \(t-1\) wraps around within the day at the start (so the charge state at the end of the day comes back to the start of the day).
</p>

<p>
Because of this, charge within the store cannot be passed between representative day <i>types</i>, or stored for more than a single day.
</p></dd>

<dt>Substation headroom</dt><dd><p>
\(\forall t, n : \sum_{p | Sub_p = n} -R_n \times Cap_n \leq L_{n, t} - eP_p \times Output_n/eH_p \leq Cap_n\)
</p>

<p>
Where \(eP_p = -1\) if the plant is not a CHP but is electrically powered.
</p></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org8065741" class="outline-2">
<h2 id="org8065741"><span class="section-number-2">5</span> Future work</h2>
<div class="outline-text-2" id="text-5">
<p>
It would be useful to support two further features
</p>

<ol class="org-ol">
<li>Binary output variables; some plant either runs or doesn't</li>
<li>Limited switch-ons; some plant should not be turned on and off too frequently</li>
</ol>
</div>
</div>
</div>
</body>
</html>
